* Docker
** Login to registry

   #+begin_src bash :results verbatim
     export SECRET_TOKEN=$(cat registry-secret-token)
     docker login rg.fr-par.scw.cloud/pockmon -u nologin -p $SECRET_TOKEN
   #+end_src

   #+RESULTS:
   : Login Succeeded

** Build image

   #+begin_src bash :results verbatim
     DOCKER_BUILDKIT=1 docker build . -t rg.fr-par.scw.cloud/pockmon/pockmon:manual 2>&1
   #+end_src

   #+RESULTS:
   #+begin_example
   #2 [internal] load .dockerignore
   #2 transferring context: 2B done
   #2 DONE 0.0s

   #1 [internal] load build definition from Dockerfile
   #1 transferring dockerfile: 38B done
   #1 DONE 0.1s

   #3 [internal] load metadata for docker.io/library/golang:1.15.0-alpine@sha2...
   #3 DONE 0.0s

   #4 [stage-0 1/4] FROM docker.io/library/golang:1.15.0-alpine@sha256:59eae48...
   #4 DONE 0.0s

   #6 [internal] load build context
   #6 transferring context: 21.30kB 0.0s done
   #6 DONE 0.0s

   #5 [stage-0 2/4] RUN apk add --no-cache ca-certificates && update-ca-certif...
   #5 CACHED

   #7 [stage-0 3/4] ADD . /go/src/github.com/app/app
   #7 DONE 0.1s

   #8 [stage-0 4/4] RUN go build -a -ldflags '-extldflags "static" -w -s' gith...
   #8 DONE 5.2s

   #9 [stage-1 1/2] COPY --from=0 /etc/ssl/certs/ca-certificates.crt /etc/ssl/...
   #9 CACHED

   #10 [stage-1 2/2] COPY --from=0 /go/app /app
   #10 CACHED

   #11 exporting to image
   #11 exporting layers done
   #11 writing image sha256:7408f0f36fa03ea8120b21250f96c1ff22199a7f5e0af90536ffc9e17bc03127 done
   #11 naming to rg.fr-par.scw.cloud/pockmon/pockmon:manual done
   #11 DONE 0.0s
   #+end_example

** Push image

   #+begin_src bash :results verbatim
     docker push rg.fr-par.scw.cloud/pockmon/pockmon:manual
   #+end_src

   #+RESULTS:
   : The push refers to repository [rg.fr-par.scw.cloud/pockmon/pockmon]
   : 4adf51fb0121: Preparing
   : 14742aeb5a45: Preparing
   : 4adf51fb0121: Pushed
   : 14742aeb5a45: Pushed
   : manual: digest: sha256:b7bb8d55ba45151c1bfc5da18d76ba9f65cc596a634baf8fa434e57baafee713 size: 737
